; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   blue_ball_1 green_ball_1 - ball
   empty - empty_0
   yellow_door_1 green_door_1 - door
   room_2 room_4 room_3 - room
   purple_box_1 - box
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (carrying blue_ball_1) (hold_2)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (carrying blue_ball_1) (hold_2)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (or (= ?door green_door_1) (carrying blue_ball_1)) (hold_2)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (hold_1)) (when (carrying blue_ball_1) (hold_2)) (when (or (= ?room2 room_2) (and (agentinroom room_2) (not (= ?room1 room_2)))) (hold_4)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (or (and (objectinroom purple_box_1 room_3) (not (and (= ?obj purple_box_1) (= ?room room_3)))) (not (locked yellow_door_1))) (hold_0)) (when (or (at_ green_door_1) (= ?obj blue_ball_1) (carrying blue_ball_1)) (hold_2)) (hold_3) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (and (= ?obj purple_box_1) (= ?room room_3)) (objectinroom purple_box_1 room_3) (not (locked yellow_door_1))) (hold_0)) (when (or (at_ green_door_1) (and (carrying blue_ball_1) (not (= ?obj blue_ball_1)))) (hold_2)) (when (or (and (= ?obj green_ball_1) (= ?room room_3)) (objectinroom green_ball_1 room_3)) (hold_3)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (or (objectinroom purple_box_1 room_3) (not (or (and (not (locked ?door)) (= ?door yellow_door_1)) (and (locked yellow_door_1) (not (and (locked ?door) (= ?door yellow_door_1))))))) (hold_0)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   yellow_door_2 red_door_1 - door
   blue_box_2 grey_box_1 blue_box_3 blue_box_1 - box
   yellow_ball_1 - ball
 )
 (:init (agentinroom room_1) (objectinroom blue_box_1 room_1) (objectinroom blue_box_2 room_1) (objectinroom purple_box_1 room_2) (objectinroom green_ball_1 room_2) (objectinroom yellow_ball_1 room_3) (objectinroom blue_box_3 room_3) (objectinroom blue_ball_1 room_4) (objectinroom grey_box_1 room_4) (objectcolor blue_box_1 bluetype) (objectcolor blue_box_2 bluetype) (objectcolor purple_box_1 purpletype) (objectcolor green_ball_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_box_3 bluetype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_box_1 greytype) (objectcolor yellow_door_1 yellowtype) (objectcolor yellow_door_2 yellowtype) (objectcolor red_door_1 redtype) (objectcolor green_door_1 greentype) (emptyhands) (locked yellow_door_1) (locked yellow_door_2) (locked red_door_1) (locked green_door_1) (adjacentrooms room_2 room_1 yellow_door_1) (adjacentrooms room_1 room_2 yellow_door_1) (adjacentrooms room_3 room_1 yellow_door_2) (adjacentrooms room_1 room_3 yellow_door_2) (adjacentrooms room_4 room_2 red_door_1) (adjacentrooms room_2 room_4 red_door_1) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_1) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v bluetype) (at_ ?v))) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor yellow_door_1 room_1 room_2)
   added: (at_ yellow_door_1)
   goals met: 0 of 6
2. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   added: (hold_0)
   goals met: 1 of 6
3. (gotoobject blue_box_1 room_1)
   deleted: (at_ yellow_door_1)
   added: (at_ blue_box_1)
   goals met: 2 of 6
4. (pick blue_box_1 room_1)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_1)
   added: (carrying blue_box_1) (hold_3)
   goals met: 2 of 6
5. (gotoroom room_1 room_2 yellow_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_2) (visited room_2) (hold_4)
   goals met: 3 of 6
6. (gotodoor red_door_1 room_2 room_4)
   added: (at_ red_door_1)
   goals met: 3 of 6
7. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 3 of 6
8. (gotoroom room_2 room_4 red_door_1)
   deleted: (agentinroom room_2) (at_ red_door_1)
   added: (agentinroom room_4) (visited room_4) (hold_1)
   goals met: 4 of 6
9. (gotodoor green_door_1 room_4 room_3)
   added: (at_ green_door_1) (hold_2)
   goals met: 5 of 6
10. (gotoempty)
   deleted: (at_ green_door_1)
   added: (at_ empty)
   goals met: 5 of 6
11. (drop blue_box_1 room_4)
   deleted: (carrying blue_box_1) (at_ empty)
   added: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_4)
   goals met: 6 of 6
